vovaok/stm32-plus-plus/src/gpio.h
        SPI2_NSS_PB12 =     PINCONFIG(PB12, modeAF | speed50MHz, afSpi2), //!.
        I2S2_WS_PB12 =      PINCONFIG(PB12, modeAF | speed50MHz, afSpi2), //!.
        SPI2_SCK_PB13 =     PINCONFIG(PB13, modeAF | speed50MHz, afSpi2), //!.
        I2S2_CK_PB13 =      PINCONFIG(PB13, modeAF | speed50MHz, afSpi2), //!.
        SPI2_MISO_PB14 =    PINCONFIG(PB14, modeAF | speed50MHz, afSpi2), //!.
        SPI2_MOSI_PB15 =    PINCONFIG(PB15, modeAF | speed50MHz, afSpi2), //!.
        I2S2_SD_PB15 =      PINCONFIG(PB15, modeAF | speed50MHz, afSpi2), //!.
        SPI2_MISO_PC2 =     PINCONFIG(PC2,  modeAF | speed50MHz, afSpi2), //!.
        SPI2_MOSI_PC3 =     PINCONFIG(PC3,  modeAF | speed50MHz, afSpi2), //!.
        I2S2_SD_PC3 =       PINCONFIG(PC3,  modeAF | speed50MHz, afSpi2), //!.
        I2S2_MCK_PC6 =      PINCONFIG(PC6,  modeAF | speed50MHz, afSpi2), //!.
        I2S_CKIN_PC9 =      PINCONFIG(PC9,  modeAF | speed50MHz, afSpi2), //!.
        SPI2_NSS_PI0 =      PINCONFIG(PI0,  modeAF | speed50MHz, afSpi2), //!.
        I2S2_WS_PI0 =       PINCONFIG(PI0,  modeAF | speed50MHz, afSpi2), //!.
        SPI2_SCK_PI1 =      PINCONFIG(PI1,  modeAF | speed50MHz, afSpi2), //!.
        I2S2_CK_PI1 =       PINCONFIG(PI1,  modeAF | speed50MHz, afSpi2), //!.
        SPI2_MISO_PI2 =     PINCONFIG(PI2,  modeAF | speed50MHz, afSpi2), //!.
        SPI2_MOSI_PI3 =     PINCONFIG(PI3,  modeAF | speed50MHz, afSpi2), //!.
        I2S2_SD_PI3 =       PINCONFIG(PI3,  modeAF | speed50MHz, afSpi2), //!.
        // nedodelano I2S2ext!!!!!
        SPI3_NSS_PA4 =      PINCONFIG(PA4,  modeAF | speed50MHz, afSpi3), //!.
        I2S3_WS_PA4 =       PINCONFIG(PA4,  modeAF | speed50MHz, afSpi3), //!.
        SPI3_NSS_PA15 =     PINCONFIG(PA15, modeAF | speed50MHz, afSpi3), //!.
        I2S3_WS_PA15 =      PINCONFIG(PA15, modeAF | speed50MHz, afSpi3), //!.
        SPI3_SCK_PB3 =      PINCONFIG(PB3,  modeAF | speed50MHz, afSpi3), //!.
        I2S3_CK_PB3 =       PINCONFIG(PB3,  modeAF | speed50MHz, afSpi3), //!.
        SPI3_MISO_PB4 =     PINCONFIG(PB4,  modeAF | speed50MHz, afSpi3), //!.
        SPI3_MOSI_PB5 =     PINCONFIG(PB5,  modeAF | speed50MHz, afSpi3), //!.
        I2S3_SD_PB5 =       PINCONFIG(PB5,  modeAF | speed50MHz, afSpi3), //!.
        I2S3_MCK_PC7 =      PINCONFIG(PC7,  modeAF | speed50MHz, afSpi3), //!.
        SPI3_SCK_PC10 =     PINCONFIG(PC10, modeAF | speed50MHz, afSpi3), //!.
        I2S3_CK_PC10 =      PINCONFIG(PC10, modeAF | speed50MHz, afSpi3), //!.
        SPI3_MISO_PC11 =    PINCONFIG(PC11, modeAF | speed50MHz, afSpi3), //!.
        SPI3_MOSI_PC12 =    PINCONFIG(PC12, modeAF | speed50MHz, afSpi3), //!.
        I2S3_SD_PC12 =      PINCONFIG(PC12, modeAF | speed50MHz, afSpi3), //!.
        // nedodelano I2S3ext
        // OTG_FS
        OTG_FS_SOF =        PINCONFIG(PA8,  modeAF | speed100MHz, afOtgFs), //!<.
      //  OTG_FS_VBUS =       PINCONFIG(PA9,  modeAF | speed100MHz, afOtgFs), //!<.
      //  OTG_FS_ID =         PINCONFIG(PA10, modeAF | outOpenDrain | pullUp | speed100MHz, afOtgFs), //!<.
        OTG_FS_DM =         PINCONFIG(PA11, modeAF | speed100MHz, afOtgFs), //!<.
        OTG_FS_DP =         PINCONFIG(PA12, modeAF | speed100MHz, afOtgFs), //!<.
        // OTG_HS
        OTG_HS_SOF =        PINCONFIG(PA4,  modeAF | speed100MHz, afOtgHsFs), //!<.
        OTG_HS_ID =         PINCONFIG(PB12, modeAF | speed100MHz, afOtgHsFs), //!<.
        OTG_HS_VBUS =       PINCONFIG(PB13, modeIn | speed100MHz, afNone   ), //!<.
        OTG_HS_DM =         PINCONFIG(PB14, modeAF | speed100MHz, afOtgHsFs), //!<.
        OTG_HS_DP =         PINCONFIG(PB15, modeAF | speed100MHz, afOtgHsFs), //!<.
        // OTG_HS (ULPI)
        OTG_HS_ULPI_D0 =    PINCONFIG(PA3,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D1 =    PINCONFIG(PB0,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D2 =    PINCONFIG(PB1,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D3 =    PINCONFIG(PB10, modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D4 =    PINCONFIG(PB11, modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D5 =    PINCONFIG(PB12, modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D6 =    PINCONFIG(PB13, modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_D7 =    PINCONFIG(PB5,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_CLK =   PINCONFIG(PA5,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_NXT =   PINCONFIG(PC3,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_DIR =   PINCONFIG(PC2,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_STP =   PINCONFIG(PC0,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_NXT_PH4=PINCONFIG(PH4,  modeAF | speed100MHz, afOtgHs), //!<.
        OTG_HS_ULPI_DIR_PI11=PINCONFIG(PI11,modeAF | speed100MHz, afOtgHs), //!<.\n to be continued....
    } Config;
    
private:
    typedef union
    {
        Config config;
        struct
        {
            unsigned char pin;
            unsigned char flags;
            unsigned char af;
        };
        struct
        {
            unsigned char pinNumber: 4;
            unsigned char portNumber: 3;
            unsigned char : 1;
            unsigned char mode: 2;
            unsigned char outType: 1;
            unsigned char pull: 2;
            unsigned char speed: 2;
            unsigned char : 1;
            unsigned char afNumber;
        };
    } ConfigStruct;
  
    static unsigned char mPinsUsed[140];
    static void usePin(const ConfigStruct &cfg);
    ConfigStruct mConfig;
    GPIO_TypeDef *mPort;
    uint32_t mPin;
    
//    bool mState;
    
    void init();
    static GPIO_TypeDef *getPortByNumber(int port);
    void updateConfig();
//    void setFlags(Flags flags);
    
public:
    /*! Constructor with explicit pin configuration.
        You should use it if there is not necessary configuration available.
        But other constructor is more convenient.
    */
    Gpio(PinName pin, Flags flags = flagsDefault, PinAF altFunction = afNone);
    
    /*! Constructor with predefined pin configuration.
        Convenient for fast configuration.
    */
    Gpio(Config config);
    
    /*! Initialize pin with explicit configuration.
        This function is useful when you not need to create an instance
        for manipulating the pin in the future.\n
        Try better using another implementation that accepts predefined config.
    */
    static void config(PinName pin, Flags flags = flagsDefault, PinAF altFunction = afNone);
    
    /*! Initialize pin with predefined configuration.
        This function is useful when you not need to create an instance
        for manipulating the pin in the future.\n
        \b Note: Use of this function is preferred.
        \param conf Pin configuration, see Config for details.
    */
    static void config(const Config &conf);
    
