vovaok/stm32-plus-plus/src/gpio.h
    /*! Initialize \c count pins with predefined configurations.
        Convenient when initializing several pins in one line of code.
        Using example: config(2, CAN_RX_PB8, CAN_TX_PB9);
        \param count The count of the pins to configure.
        \param conf1 Configuration of the first pin.
    */
    static void config(int count, Config conf1, ...);
    
    /*! Изменение конфигурации как вход без подтяжки.
        По идее, можно вызывать в любое время.
    */
    void setAsInput();
    
    /*! Изменение конфигурации как вход с подтяжкой к питанию.
        По идее, можно вызывать в любое время.
    */
    void setAsInputPullUp();
    
    /*! Изменение конфигурации как вход с подтяжкой к земле.
        По идее, можно вызывать в любое время.
    */
    void setAsInputPullDown();
    
    /*! Изменение конфигурации как выход.
        По идее, можно вызывать в любое время.
    */
    void setAsOutput();
    
    /*! Изменение конфигурации как выход с открытым стоком.
        По идее, можно вызывать в любое время.
    */
    void setAsOutputOpenDrain();
    
    /*! Чтение состояния ноги. 
        \return \c true, если на ноге 1, \c false, если 0. Что логично.
    */
    bool read() const;
    
    /*! Запись состояния ноги.
        \param value \c true, чтобы выставить 1, \c false - 0. И это нормально.
    */
    void write(bool value);
    
    /*! Установка ноги в 1 */
    inline void set() {mPort->BSRRL = mPin;}
    
    /*! Сброс ноги в 0 */
    inline void reset() {mPort->BSRRH = mPin;}
    
       /*! запись порта*/
    void writePort(short value);

    /*! чтение порта*/
    short readPort();
};

#endif